InformationRegisters/IndividualsDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>IndividualsDocuments</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Series</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ValidityPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WhoIssued</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DivisionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsIdentityDocument</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Presentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DeleteDocumentKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IndividualsDocumentsKinds</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DocumentKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IndividualsDocumentsKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/IndividualsDocuments/Ext/RecordSetModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS

Procedure BeforeWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	TextSeries				= NStr("en = ', series: %1'");
	TextNumber				= NStr("en = ',  No.%1'");
	TextIssuanceDate			= NStr("en = ', issued: %1 year'");
	TextValidityPeriod		= NStr("en = ', valid till: %1 year'");
	TextDivisionCode	= NStr("en = ', div. No.%1'");
	
	For Each Record IN ThisObject Do
		If Record.DocumentKind.IsEmpty() Then
			Record.Presentation = "";
			
		Else
			Record.Presentation = ""
				+ Record.DocumentKind
				+ ?(ValueIsFilled(Record.Series), StringFunctionsClientServer.PlaceParametersIntoString(TextSeries, Record.Series), "")
				+ ?(ValueIsFilled(Record.Number), StringFunctionsClientServer.PlaceParametersIntoString(TextNumber, Record.Number), "")
				+ ?(ValueIsFilled(Record.IssueDate), StringFunctionsClientServer.PlaceParametersIntoString(TextIssuanceDate, Format(Record.IssueDate,"DF=dd MMMM yyyy'")), "")
				+ ?(ValueIsFilled(Record.ValidityPeriod), StringFunctionsClientServer.PlaceParametersIntoString(TextValidityPeriod, Format(Record.ValidityPeriod,"DF=dd MMMM yyyy'")), "")
				+ ?(ValueIsFilled(Record.WhoIssued), ", " + Record.WhoIssued, "")
				+ ?(ValueIsFilled(Record.DivisionCode) AND Record.DocumentKind = Catalogs.IndividualsDocumentsKinds.LocalPassport, StringFunctionsClientServer.PlaceParametersIntoString(TextDivisionCode, Record.DivisionCode), "");
			
		EndIf;
	EndDo;
	
EndProcedure

Procedure OnWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	Query = New Query;
	Query.SetParameter("DocumentsTable",	Unload(, "Ind, Period, IsIdentityDocument"));
	
	Query.Text =
	"SELECT
	|	DocumentsTable.Ind AS Ind,
	|	DocumentsTable.Period AS Period
	|INTO TU_Documents
	|FROM
	|	&DocumentsTable AS DocumentsTable
	|WHERE
	|	DocumentsTable.IsIdentityDocument
	|
	|INDEX BY
	|	Ind,
	|	Period
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	IndividualsDocuments.Ind AS Ind,
	|	IndividualsDocuments.Period AS Period,
	|	COUNT(IndividualsDocuments.Ind) AS DocumentsCount
	|FROM
	|	InformationRegister.IndividualsDocuments AS IndividualsDocuments
	|		INNER JOIN TU_Documents AS DocumentsSlice
	|		ON IndividualsDocuments.Period = DocumentsSlice.Period
	|			AND IndividualsDocuments.Ind = DocumentsSlice.Ind
	|			AND (IndividualsDocuments.IsIdentityDocument)
	|
	|GROUP BY
	|	IndividualsDocuments.Ind,
	|	IndividualsDocuments.Period
	|
	|HAVING
	|	COUNT(IndividualsDocuments.Ind) > 1";
	Selection = Query.Execute().Select();
	
	MessageText = NStr("en = 'The ID of %2 has been entered already as of 1%.'");
	
	While Selection.Next() Do
		Cancel = True;
		
		CommonUseClientServer.MessageToUser(StringFunctionsClientServer.PlaceParametersIntoString(MessageText, Format(Selection.Period, "DLF=D"), Selection.Ind));
	EndDo;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	For Each Record IN ThisObject Do
		RecordStructure = New Structure("Period, Ind, DocumentKind");
		FillPropertyValues(RecordStructure, Record);
		
		RecordKey = InformationRegisters.IndividualsDocuments.CreateRecordKey(RecordStructure);
		
		If Not IsBlankString(Record.Series) Then
			ErrorText = "";
			Cancel = Not IndividualsDocumentsClientServer.DocumentSeriesSpecifiedProperly(Record.DocumentKind, Record.Series, ErrorText) Or Cancel;
			If Not IsBlankString(ErrorText) Then
				CommonUseClientServer.MessageToUser(ErrorText, RecordKey, "Record.Series");
			EndIf;
		EndIf;
		
		If Not IsBlankString(Record.Number) Then
			ErrorText = "";
			Cancel = Not IndividualsDocumentsClientServer.DocumentNumberSpecifiedProperly(Record.DocumentKind, Record.Number, ErrorText) Or Cancel;
			If Not IsBlankString(ErrorText) Then
				CommonUseClientServer.MessageToUser(ErrorText, RecordKey, "Record.Number");
			EndIf;
		EndIf;
	EndDo;
	
EndProcedure


#EndIf
